<a href="https://colab.research.google.com/github/bob8dod/Kaggle_and_Dacon/blob/main/Dacon/(2)_%EC%8B%A0%EC%9A%A9%EC%B9%B4%EB%93%9C_%EC%82%AC%EC%9A%A9%EC%9E%90_%EC%97%B0%EC%B2%B4_%EC%98%88%EC%B8%A1_AI_%EA%B2%BD%EC%A7%84%EB%8C%80%ED%9A%8C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [86]:
train = pd.read_csv('/content/train.csv')
test_data = pd.read_csv('/content/test.csv')

## 데이터 확인 및 분리

In [45]:
train.head()

   index gender car reality  ...   occyp_type  family_size begin_month credit
0      0      F   N       N  ...          NaN          2.0        -6.0    1.0
1      1      F   N       Y  ...     Laborers          3.0        -5.0    1.0
2      2      M   Y       Y  ...     Managers          2.0       -22.0    2.0
3      3      F   N       Y  ...  Sales staff          2.0       -37.0    0.0
4      4      F   Y       Y  ...     Managers          2.0       -26.0    2.0

[5 rows x 20 columns]

gender: 성별


car: 차량 소유 여부


reality: 부동산 소유 여부


child_num: 자녀 수


income_total: 연간 소득


income_type: 소득 분류


							['Commercial associate', 'Working', 'State servant', 'Pensioner', 'Student']



edu_type: 교육 수준


							['Higher education' ,'Secondary / secondary special', 'Incomplete higher', 'Lower secondary', 'Academic degree']



family_type: 결혼 여부


							['Married', 'Civil marriage', 'Separated', 'Single / not married', 'Widow']



house_type: 생활 방식


							['Municipal apartment', 'House / apartment', 'With parents',

							

							 'Co-op apartment', 'Rented apartment', 'Office apartment']



DAYS_BIRTH: 출생일


							데이터 수집 당시 (0)부터 역으로 셈, 즉, -1은 데이터 수집일 하루 전에 태어났음을 의미



DAYS_EMPLOYED: 업무 시작일


							데이터 수집 당시 (0)부터 역으로 셈, 즉, -1은 데이터 수집일 하루 전부터 일을 시작함을 의미

													

							양수 값은 고용되지 않은 상태를 의미함



FLAG_MOBIL: 핸드폰 소유 여부


work_phone: 업무용 전화 소유 여부


phone: 전화 소유 여부


email: 이메일 소유 여부


occyp_type: 직업 유형													


family_size: 가족 규모


begin_month: 신용카드 발급 월
			

							데이터 수집 당시 (0)부터 역으로 셈, 즉, -1은 데이터 수집일 한 달 전에 신용카드를 발급함을 의미







credit: 사용자의 신용카드 대금 연체를 기준으로 한 신용도


							=> 낮을 수록 높은 신용의 신용카드 사용자를 의미함

In [87]:
print(train.isnull().sum())
print(test_data.isnull().sum())

index               0
gender              0
car                 0
reality             0
child_num           0
income_total        0
income_type         0
edu_type            0
family_type         0
house_type          0
DAYS_BIRTH          0
DAYS_EMPLOYED       0
FLAG_MOBIL          0
work_phone          0
phone               0
email               0
occyp_type       8171
family_size         0
begin_month         0
credit              0
dtype: int64
index               0
gender              0
car                 0
reality             0
child_num           0
income_total        0
income_type         0
edu_type            0
family_type         0
house_type          0
DAYS_BIRTH          0
DAYS_EMPLOYED       0
FLAG_MOBIL          0
work_phone          0
phone               0
email               0
occyp_type       3152
family_size         0
begin_month         0
dtype: int64

In [88]:
to_check = ['gender', 'car', 'reality', 'child_num', 'income_type', 'edu_type', 'family_type','house_type', 'FLAG_MOBIL', 'work_phone', 'phone', 'email', 'family_size', 'credit'] #occyp_type
for col in to_check:
    print(col, np.unique(train[col]), '->', len(np.unique(train[col])))
print('-----------------------')
for col in to_check:
    if col == 'credit':
        continue
    print(col, np.unique(test_data[col]), '->', len(np.unique(test_data[col])))

gender ['F' 'M'] -> 2
car ['N' 'Y'] -> 2
reality ['N' 'Y'] -> 2
child_num [ 0  1  2  3  4  5  7 14 19] -> 9
income_type ['Commercial associate' 'Pensioner' 'State servant' 'Student' 'Working'] -> 5
edu_type ['Academic degree' 'Higher education' 'Incomplete higher'
 'Lower secondary' 'Secondary / secondary special'] -> 5
family_type ['Civil marriage' 'Married' 'Separated' 'Single / not married' 'Widow'] -> 5
house_type ['Co-op apartment' 'House / apartment' 'Municipal apartment'
 'Office apartment' 'Rented apartment' 'With parents'] -> 6
FLAG_MOBIL [1] -> 1
work_phone [0 1] -> 2
phone [0 1] -> 2
email [0 1] -> 2
family_size [ 1.  2.  3.  4.  5.  6.  7.  9. 15. 20.] -> 10
credit [0. 1. 2.] -> 3
-----------------------
gender ['F' 'M'] -> 2
car ['N' 'Y'] -> 2
reality ['N' 'Y'] -> 2
child_num [0 1 2 3 4 5] -> 6
income_type ['Commercial associate' 'Pensioner' 'State servant' 'Student' 'Working'] -> 5
edu_type ['Academic degree' 'Higher education' 'Incomplete higher'
 'Lower secondary' 'Secondary / secondary special'] -> 5
family_type ['Civil marriage' 'Married' 'Separated' 'Single / not married' 'Widow'] -> 5
house_type ['Co-op apartment' 'House / apartment' 'Municipal apartment'
 'Office apartment' 'Rented apartment' 'With parents'] -> 6
FLAG_MOBIL [1] -> 1
work_phone [0 1] -> 2
phone [0 1] -> 2
email [0 1] -> 2
family_size [1. 2. 3. 4. 5. 6. 7.] -> 7

**child_num** :  7,14,19 같은 test에 없는 값같은 경우 많은 비율을 차지하지 않기때문에 제거해도 될듯  
**FLAG_MOBIL** : 모든 값이 1, 제거 필요  
**family_size** : 9,15,20 같은 test에 없는 값 같은 경우 많은 비율을 차지하지 않기 때문에 제거 필요 -> 찾아보니 child_num 과 같은 사람들임.

In [89]:
del_idx = []
for i in [7,14,19]:
    del_idx.extend(list(train[train['child_num']==i].index))
del_idx

[25313, 25638, 8462, 9021, 25390, 10731]

In [90]:
del_idx2 = []
for i in [9,15,20]:
    del_idx2.extend(list(train[train['family_size']==i].index))
del_idx2

[25313, 25638, 8462, 9021, 25390, 10731]

In [91]:
del_idx == del_idx2

True

In [92]:
train = train.drop(del_idx).reset_index(drop=True)
train.head()

   index gender car reality  ...   occyp_type  family_size begin_month credit
0      0      F   N       N  ...          NaN          2.0        -6.0    1.0
1      1      F   N       Y  ...     Laborers          3.0        -5.0    1.0
2      2      M   Y       Y  ...     Managers          2.0       -22.0    2.0
3      3      F   N       Y  ...  Sales staff          2.0       -37.0    0.0
4      4      F   Y       Y  ...     Managers          2.0       -26.0    2.0

[5 rows x 20 columns]

In [93]:
train['child_num'].unique()

array([0, 1, 2, 3, 4, 5])

In [178]:
# 데이터 분리 및 불필요한 col 제거
X = train.drop(['index','credit','FLAG_MOBIL','occyp_type'], axis=1)
test = test_data.drop(['index', 'FLAG_MOBIL','occyp_type'], axis=1)
y = train['credit']
print(X.shape)
print(y.shape)
print(test.shape)

(26451, 16)
(26451,)
(10000, 16)

## 데이터 전처리

In [179]:
X['DAYS_BIRTH'] = X['DAYS_BIRTH'].apply(lambda x:abs(x//360))
test['DAYS_BIRTH'] = test['DAYS_BIRTH'].apply(lambda x:abs(x//360))
X['DAYS_EMPLOYED'] = X['DAYS_EMPLOYED'].apply(lambda x:abs(x//360))
test['DAYS_EMPLOYED'] = test['DAYS_EMPLOYED'].apply(lambda x:abs(x//360))
X['begin_month'] = X['begin_month'].apply(lambda x:int(abs(x)))
test['begin_month'] = test['begin_month'].apply(lambda x:int(abs(x)))

In [180]:
X.head(3)

  gender car reality  child_num  ...  phone email family_size begin_month
0      F   N       N          0  ...      0     0         2.0           6
1      F   N       Y          1  ...      0     1         3.0           5
2      M   Y       Y          0  ...      1     0         2.0          22

[3 rows x 16 columns]

In [181]:
test.head(3)

  gender car reality  child_num  ...  phone email family_size begin_month
0      M   Y       N          0  ...      1     0         2.0          60
1      F   N       Y          0  ...      1     0         2.0          36
2      F   N       Y          0  ...      1     0         2.0          40

[3 rows x 16 columns]

In [182]:
from sklearn.preprocessing import LabelEncoder
str2int = 'gender car reality income_type edu_type family_type house_type'
for col in str2int.split():
    le = LabelEncoder()
    X[col] = le.fit_transform(X[col])
    test[col] = le.transform(test[col])

In [161]:
# from sklearn.preprocessing import RobustScaler
# ro = RobustScaler()
# X[['income_total', 'DAYS_BIRTH', 'DAYS_EMPLOYED', 'begin_month']] = ro.fit_transform(X[['income_total', 'DAYS_BIRTH', 'DAYS_EMPLOYED', 'begin_month']])
# test[['income_total', 'DAYS_BIRTH', 'DAYS_EMPLOYED', 'begin_month']] = ro.transform(test[['income_total', 'DAYS_BIRTH', 'DAYS_EMPLOYED', 'begin_month']])

In [187]:
X = X.drop(['income_total'], axis=1)
test = test.drop(['income_total'], axis=1)

In [188]:
X.head(3)

   gender  car  reality  child_num  ...  phone  email  family_size  begin_month
0       0    0        0          0  ...      0      0          2.0            6
1       0    0        1          1  ...      0      1          3.0            5
2       1    1        1          0  ...      1      0          2.0           22

[3 rows x 15 columns]

## 모델 구축

In [189]:
from sklearn.model_selection import train_test_split

X_train, X_val, y_train, y_val = train_test_split(X, y, 
                                                    stratify=y, test_size=0.25,
                                                    random_state = 10086)

In [190]:
from lightgbm import LGBMClassifier
from sklearn.model_selection import GridSearchCV
lgbm = LGBMClassifier(n_estimators=400)
parameters = {'learning_rate':[0.05,0.1,0.2,0.3], 'max_depth': [3, 7, 10, 15]}
clf = GridSearchCV(lgbm, parameters, n_jobs=-1)
clf.fit(X_train,y_train)

GridSearchCV(cv=None, error_score=nan,
             estimator=LGBMClassifier(boosting_type='gbdt', class_weight=None,
                                      colsample_bytree=1.0,
                                      importance_type='split',
                                      learning_rate=0.1, max_depth=-1,
                                      min_child_samples=20,
                                      min_child_weight=0.001,
                                      min_split_gain=0.0, n_estimators=400,
                                      n_jobs=-1, num_leaves=31, objective=None,
                                      random_state=None, reg_alpha=0.0,
                                      reg_lambda=0.0, silent=True,
                                      subsample=1.0, subsample_for_bin=200000,
                                      subsample_freq=0),
             iid='deprecated', n_jobs=-1,
             param_grid={'learning_rate': [0.05, 0.1, 0.2, 0.3],
                         'max_depth': [3, 7, 10, 15]},
             pre_dispatch='2*n_jobs', refit=True, return_train_score=False,
             scoring=None, verbose=0)

In [191]:
clf.best_params_

{'learning_rate': 0.05, 'max_depth': 15}

In [192]:
from sklearn.metrics import log_loss
from tensorflow.keras.utils import to_categorical

y_pred = clf.predict_proba(X_val)
print(f"log_loss: {log_loss(to_categorical(y_val), y_pred)}")

log_loss: 0.7753261407861087

In [193]:
pred = clf.predict_proba(test)
submission = pd.read_csv('/content/sample_submission.csv')
for idx, i in enumerate(pred):
    submission.loc[idx,['0']] = i[0]
    submission.loc[idx,['1']] = i[1]
    submission.loc[idx,['2']] = i[2]

In [176]:
submission.to_csv('submit.csv', index=False)

In [177]:
submission

      index         0         1         2
0     26457  0.068021  0.139193  0.792786
1     26458  0.129996  0.137309  0.732695
2     26459  0.077177  0.117531  0.805291
3     26460  0.068679  0.161917  0.769404
4     26461  0.093217  0.174567  0.732216
...     ...       ...       ...       ...
9995  36452  0.117115  0.131130  0.751755
9996  36453  0.141618  0.285366  0.573016
9997  36454  0.136289  0.161366  0.702345
9998  36455  0.100660  0.262230  0.637110
9999  36456  0.053406  0.181145  0.765449

[10000 rows x 4 columns]